Revit 2027 API
BuiltInFailures.RoofFailures.RoofCutoffRemoved Property
 The roof's cutoff failed and was removed; make sure the cutoff height is not below the roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoofCutoffRemoved { get; }
Public Shared ReadOnly Property RoofCutoffRemoved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoofCutoffRemoved {
	FailureDefinitionId^ get ();
}
static member RoofCutoffRemoved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace